<!-- a6fc14d642af41a519180d78989da5d22a0411f0 -->
<details open>
    <summary>
        <h2>Gruntwork Pipelines Plan for a6fc14d642af41a519180d78989da5d22a0411f0</h2>
    </summary>
    <table>
<!--
RUNTIME_CONFIG
name: Unit Added
working_directory: sandbox/_global/iam-role
terragrunt_version: v0.93.1
tfbinary_version: v1.10.6
tfbinary: tofu
-->
        <tr>
            <td align='left' width='800px'>
                ✅ <b>Unit Added:</b> <code>iam-role</code>
            </td>
        </tr>
        <tr>
            <td><code>sandbox/_global/iam-role</code>
                <br />
                <br /><details><summary><b>Plan Summary</b>: 1 to add, 0 to change, 0 to destroy</summary>
Added Resources: <br />
<ul>
  <li><code>aws_iam_role.this[0]</code></li>
</ul>
</details>
<details><summary>Plan Output
</summary>

```terraform
OpenTofu will perform the following actions:
  # aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Version = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "example-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn                        = (known after apply)
  + name                       = (known after apply)
  + unique_id                  = (known after apply)

```

</details><a href="https://github.com/DovnarAlexander/terragrunt-scale/actions/runs/22105056805/job/63885358601#step:10:1">View Job Logs</a>
            </td>
        </tr>
        <tr>
            <td>
                <a href="https://github.com/dovnaralexander/terragrunt-scale/actions/runs/22105056805">View Pipeline</a>
                <hr/>
                <em>👉 Merge this merge request to <b>apply</b> all changes. Push new changes to run the <b>plan</b> again.</em>
            </td>
        </tr>
    </table>
</details>